studyBFR/2dBFR/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    /*
    inlet
    {
        type            fixedValue;
        value           uniform (10 0 0);
    }
    */
    
    inlet
    {
        type            groovyBC;
        variables (
            "cFactor=1;"
            "uCenter=(pos().y < 0.015) ? 2.053 : 0;"
            "uMiddle=(pos().y >= 0.015 && pos().y < 0.025) ? 4.827 : 0;"
            "uSecondary=(pos().y >= 0.025) ? 10 : 0;"
            "vSecondary=(pos().y >= 0.025) ? 4.5 : 0;"
            "u=cFactor*(uCenter+uMiddle+uSecondary);"
            "v=cFactor*(vSecondary);"
        );
        valueExpression "vector(u,v,0)";
        value           uniform (0 0 0);
    }
    
    outlet
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    } 
}

// ************************************************************************* //
