studyBFR/2dBFR/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       52739;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       52779;
    }
    bottom
    {
        type            symmetryPlane;
        nFaces          360;
        startFace       52819;
    }
    fixedWalls
    {
        type            wall;
        physicalType    wallAdiabatic;
        nFaces          482;
        startFace       53179;
    }
    frontAndBack
    {
        type            empty;
        nFaces          53200;
        startFace       53661;
    }
)

// ************************************************************************* //
